import { useParams } from "react-router-dom";
import { useRef } from "react";
import Navbar from "../../components/Navbar/Navbar";
import RelatedServices from "../../components/RelatedServices/RelatedServices";
import Footer from "../../components/Footer/Footer";
import { Link } from "react-router-dom";

// Mock service images
import serviceImg1 from "../../assets/images/services/Image.png";
import serviceImg2 from "../../assets/images/services/Image (1).png";
import serviceImg3 from "../../assets/images/services/Image (2).png";
import serviceImg4 from "../../assets/images/services/Image (3).png";

import ServDefault from "../../assets/images/services/servv.png"
import ServDefault2 from "../../assets/images/services/serv.jpg"


const mockServices = [
    {
        id: "1",
        title: "الرعاية الصحية المنزلية",
        media: [serviceImg1, serviceImg2],
        description: "خدمة رعاية كبار السن في المنزل تهدف إلى تقديم دعم شامل ومتعدد الأبعاد لكبار السن، مع التركيز على راحتهم النفسية والجسدية، وضمان شعورهم بالأمان والطمأنينة في كل لحظة من حياتهم اليومية. نحن نسعى لتوفير رعاية شخصية متكاملة، تراعي الاحتياجات الفردية لكل مسن، بدءًا من الرعاية الصحية الأساسية، مرورًا بالأنشطة اليومية، وصولًا إلى الدعم النفسي والاجتماعي، مع الاهتمام بكل التفاصيل التي تجعل حياتهم أسهل وأكثر راحة.فريقنا المتخصص يقدّم متابعة يومية دقيقة للاحتياجات الصحية، بما في ذلك قياس العلامات الحيوية، مراقبة الحالة الصحية العامة، والإشراف على تناول الأدوية في أوقاتها المحددة. نحن نحرص على اكتشاف أي تغييرات في الحالة الصحية للمسن بشكل مبكر، لضمان التدخل السريع والملائم عند الحاجة، ما يمنح العائلة راحة بال تامة ويضمن السلامة المستمرة للمسنين.إضافة إلى الرعاية الصحية، نقدم المساعدة في جميع الأنشطة اليومية، مثل الأكل، الاستحمام، ارتداء الملابس، التنقل داخل المنزل بطريقة آمنة، وممارسة التمارين البسيطة التي تحافظ على اللياقة البدنية والصحة العامة. نحن ندمج بين الرعاية الجسدية والدعم النفسي، من خلال تخصيص وقت للاستماع للمسن، إجراء الأنشطة الترفيهية، وتشجيع التفاعل الاجتماعي، ما يعزز شعورهم بالرضا والسعادة، ويقلل من الشعور بالوحدة أو القلق النفسي.كما نحرص على تقديم الدعم للأسر والمحبين من خلال إعداد تقارير دورية مفصلة حول الحالة الصحية والنفسية للمسن، وتقديم نصائح عملية للحفاظ على جودة حياتهم اليومية، ومتابعة الالتزام بالخطط الطبية والروتينية، بما يضمن أن كل خطوة تتم بأمان وفعالية. نحن نسعى دائمًا لتقديم تجربة رعاية شاملة، لا تقتصر على الجانب الصحي فقط، بل تشمل الراحة النفسية والاجتماعية، وبناء علاقة ثقة وطمأنينة بين المسن وفريق الرعاية."
    },
    {
        id: "2",
        title: "التمريض المنزلي",
        media: [serviceImg3, serviceImg4],
        description: "خدمة رعاية كبار السن في المنزل تهدف إلى تقديم دعم شامل ومتعدد الأبعاد لكبار السن، مع التركيز على راحتهم النفسية والجسدية، وضمان شعورهم بالأمان والطمأنينة في كل لحظة من حياتهم اليومية. نحن نسعى لتوفير رعاية شخصية متكاملة، تراعي الاحتياجات الفردية لكل مسن، بدءًا من الرعاية الصحية الأساسية، مرورًا بالأنشطة اليومية، وصولًا إلى الدعم النفسي والاجتماعي، مع الاهتمام بكل التفاصيل التي تجعل حياتهم أسهل وأكثر راحة.فريقنا المتخصص يقدّم متابعة يومية دقيقة للاحتياجات الصحية، بما في ذلك قياس العلامات الحيوية، مراقبة الحالة الصحية العامة، والإشراف على تناول الأدوية في أوقاتها المحددة. نحن نحرص على اكتشاف أي تغييرات في الحالة الصحية للمسن بشكل مبكر، لضمان التدخل السريع والملائم عند الحاجة، ما يمنح العائلة راحة بال تامة ويضمن السلامة المستمرة للمسنين.إضافة إلى الرعاية الصحية، نقدم المساعدة في جميع الأنشطة اليومية، مثل الأكل، الاستحمام، ارتداء الملابس، التنقل داخل المنزل بطريقة آمنة، وممارسة التمارين البسيطة التي تحافظ على اللياقة البدنية والصحة العامة. نحن ندمج بين الرعاية الجسدية والدعم النفسي، من خلال تخصيص وقت للاستماع للمسن، إجراء الأنشطة الترفيهية، وتشجيع التفاعل الاجتماعي، ما يعزز شعورهم بالرضا والسعادة، ويقلل من الشعور بالوحدة أو القلق النفسي.كما نحرص على تقديم الدعم للأسر والمحبين من خلال إعداد تقارير دورية مفصلة حول الحالة الصحية والنفسية للمسن، وتقديم نصائح عملية للحفاظ على جودة حياتهم اليومية، ومتابعة الالتزام بالخطط الطبية والروتينية، بما يضمن أن كل خطوة تتم بأمان وفعالية. نحن نسعى دائمًا لتقديم تجربة رعاية شاملة، لا تقتصر على الجانب الصحي فقط، بل تشمل الراحة النفسية والاجتماعية، وبناء علاقة ثقة وطمأنينة بين المسن وفريق الرعاية."
    },
    {
        id: "3",
        title: "العلاج الطبيعي",
        media: [serviceImg4, serviceImg1],
        description: "خدمة رعاية كبار السن في المنزل تهدف إلى تقديم دعم شامل ومتعدد الأبعاد لكبار السن، مع التركيز على راحتهم النفسية والجسدية، وضمان شعورهم بالأمان والطمأنينة في كل لحظة من حياتهم اليومية. نحن نسعى لتوفير رعاية شخصية متكاملة، تراعي الاحتياجات الفردية لكل مسن، بدءًا من الرعاية الصحية الأساسية، مرورًا بالأنشطة اليومية، وصولًا إلى الدعم النفسي والاجتماعي، مع الاهتمام بكل التفاصيل التي تجعل حياتهم أسهل وأكثر راحة.فريقنا المتخصص يقدّم متابعة يومية دقيقة للاحتياجات الصحية، بما في ذلك قياس العلامات الحيوية، مراقبة الحالة الصحية العامة، والإشراف على تناول الأدوية في أوقاتها المحددة. نحن نحرص على اكتشاف أي تغييرات في الحالة الصحية للمسن بشكل مبكر، لضمان التدخل السريع والملائم عند الحاجة، ما يمنح العائلة راحة بال تامة ويضمن السلامة المستمرة للمسنين.إضافة إلى الرعاية الصحية، نقدم المساعدة في جميع الأنشطة اليومية، مثل الأكل، الاستحمام، ارتداء الملابس، التنقل داخل المنزل بطريقة آمنة، وممارسة التمارين البسيطة التي تحافظ على اللياقة البدنية والصحة العامة. نحن ندمج بين الرعاية الجسدية والدعم النفسي، من خلال تخصيص وقت للاستماع للمسن، إجراء الأنشطة الترفيهية، وتشجيع التفاعل الاجتماعي، ما يعزز شعورهم بالرضا والسعادة، ويقلل من الشعور بالوحدة أو القلق النفسي.كما نحرص على تقديم الدعم للأسر والمحبين من خلال إعداد تقارير دورية مفصلة حول الحالة الصحية والنفسية للمسن، وتقديم نصائح عملية للحفاظ على جودة حياتهم اليومية، ومتابعة الالتزام بالخطط الطبية والروتينية، بما يضمن أن كل خطوة تتم بأمان وفعالية. نحن نسعى دائمًا لتقديم تجربة رعاية شاملة، لا تقتصر على الجانب الصحي فقط، بل تشمل الراحة النفسية والاجتماعية، وبناء علاقة ثقة وطمأنينة بين المسن وفريق الرعاية."
    }
];

const ServiceDetails = () => {
    const { id } = useParams();
    const service = mockServices.find(s => s.id === id) || mockServices[0];

    const textRef = useRef(null);



    return (
        <div>
            <Navbar />

            <section className="container">
                <div className="flex flex-col justify-center items-start">

                    {/* Title */}
                    <div className="flex flex-col justify-center items-start gap-6">


                    </div>

                    <h2 className="text-[40px]">
                        {service.title}
                    </h2>

                    <img
                        src={service.media[0]}
                        className="w-full my-10 md:h-[400px] object-cover rounded-2xl"
                        alt=""
                    />

                    {/* Description */}
                    <div className="px-4 py-6 relative">

                        <p
                            ref={textRef}
                            className="text-justify gap-8 leading-relaxed"
                        >
                            {service.description}
                        </p>


                    </div>

                    {/* Images */}
                    <div className="flex flex-col-reverse md:grid  md:grid-cols-2 justify-between items-center gap-6 mt-10">


                        <div className="grid  grid-row-2 justify-between items-center gap-6 ">
                            <img src={ServDefault} className="rounded-2xl" />
                            <img src={ServDefault2} className="rounded-2xl" />
                        </div>
                        <img
                            src={service.media[1] || "../../assets/images/services/Image (2).png"}
                            className="w-full bg-red-500 h-full object-cover rounded-2xl"
                            alt=""
                        />
                    </div>

                </div>
            </section>
            <RelatedServices currentId={id} />
            <Footer />
        </div>
    );
};

export default ServiceDetails;

